import Card from "./Card";

const CardList = () => {
  const cardsData = [
    {
      title: "تحلیل مالی مشتریان",
      description:
        "ما در کنار شما هستیم تا تصویر شفافی از وضعیت مالی‌تان داشته باشید. با تحلیل دقیق درآمد، هزینه‌ها و دارایی‌های شما، به شما کمک می‌کنیم تا مسیر بهتری برای مدیریت مالی خود انتخاب کنید.",
      list: [
        "بررسی دقیق درآمدها و هزینه‌ها",
        "ارائه پیشنهاد‌های بهینه‌سازی مالی",
        "تحلیل ریسک‌های مالی شخصی",
        "برنامه‌ریزی برای اهداف مالی کوتاه‌مدت و بلندمدت",
        "ارائه گزارش‌های مالی برای تصمیم‌گیری بهتر",
      ],
    },
    {
      title: "تحلیل وام خودرو",
      description:
        "خرید خودرو یک تصمیم مالی مهم است و ما اینجا هستیم تا به شما کمک کنیم بهترین گزینه را انتخاب کنید. با بررسی نرخ بهره، شرایط بازپرداخت و هزینه‌های پنهان، بهترین راهکار تأمین مالی خودرو را به شما پیشنهاد می‌دهیم.",
      list: [
        "مقایسه انواع وام‌های خودرو",
        "بررسی میزان توان بازپرداخت شما",
        "تحلیل نرخ بهره و شرایط وام‌دهندگان",
        "محاسبه هزینه‌های جانبی خرید خودرو",
        "ارائه بهترین استراتژی برای تأمین مالی خودرو",
      ],
    },
    {
      title: "تحلیل وام مسکن",
      description:
        "خرید خانه یکی از مهم‌ترین تصمیمات زندگی است. ما به شما کمک می‌کنیم تا با تحلیل شرایط مالی خود، مناسب‌ترین وام مسکن را انتخاب کنید و از پرداخت هزینه‌های اضافی جلوگیری کنید.",
      list: [
        "مقایسه انواع وام‌های مسکن",
        "بررسی نرخ بهره و تأثیر آن بر بازپرداخت تحلیل وضعیت مالی شما برای دریافت بهترین وام مسکن",
        "محاسبه هزینه‌های جانبی خرید خانه / آپارتمان",
        "تحلیل شرایط بازار مسکن و پیش‌بینی قیمت‌ها",
        "ارائه راهکارهای کاهش فشار مالی در بازپرداخت و برنامه ریزی مالی استهلاک تسهیلات",
      ],
    },
  ];

  return (
    <div className="grid grid-cols-1 gap-4 md:grid-cols-1 lg:grid-cols-3">
      {cardsData.map((card, index) => (
        <Card
          key={index}
          title={card.title}
          description={card.description}
          list={card.list}
        />
      ))}
    </div>
  );
};

export default CardList;
